[
  {
    "category": "guards",
    "name": "Closed Guard",
    "description": "TThe closed guard or full guard is one of the absolutely most basic guards in Brazilian jiu-jitsu. It has been around for a long time and for good reason: it works. Over the years many sweeps, back takes and submissions have been developed from this position. It would be wise for beginners to focus on this guard.",
    "difficulty": 2,
    "videos": {},
    "images": []
  },
  {
    "category": "guards",
    "name": "Shawn Williams Guard",
    "description": "The Shawn Williams guard is a bit lesser known then the other variations but it is deadly effective. Its strength comes from its amazing ability to break the posture and to limit the opponent's options. It's very easy to anticipate and beat your opponent when you know everything the top player can do. Mostly submission oriented.",
    "difficulty": 4,
    "videos": {},
    "images": []
  },
  {
    "category": "guards",
    "name": "Rubber guard",
    "description": "The rubber guard is a guard popularized and named by Eddie Bravo, it has been very controversial so far but it has shown its effectiveness in mma at least. In this position you hold the shin instead of the knee which can put a lot of pressure on the knee, watch out inflexible people!",
    "difficulty": 3,
    "videos": {},
    "images": []
  },
  {
    "category": "guards",
    "name": "Rat Guard",

    "description": "The rat guard is an alternative to the rubber guard, for those who are not flexible. It comes from an old modified judo move. From closed guard, break the posture, and almost go for a guillotine, but instead of putting the forearm around the neck, place your hand under your hand under the leg while maintaining pressure on the neck. Remember to keep your opponents harm out of the way.",

    "difficulty": 4,
    "videos": {},
    "images": []
  },
  {
    "category": "guards",
    "name": "High Guard",
    "description": "The high guard is another variation of the closed guard where you lock your legs higher on the body; this allows you to isolate the shoulders. It's one of the positions with the best posture control and is deadly effective for setting ups submissions, primarily armbars and triangle chokes. Some would consider it the ancestor of the rubber guard.",

    "difficulty": 3,
    "videos": {},
    "images": []
  },
  {
    "category": "guards",
    "name": " J-guard",

    "description": "A variation on the closed guard where you make a 90° angle while holding one of his arms near your shoulder with your arm circled behind your neck. It's an uncommon position which means most people won't be prepared for it. Absolutely lethal because of the heavy posture control and superb angle.",

    "difficulty": 3,
    "videos": {},
    "images": []
  },
  {
    "category": "guards",
    "name": "Classic Halfguard",

    "description": "This is the original version of the halfguard where you figure four your legs around on of his and work the underhook with your outside arm. The development of this position was an absolute milestone in the evolution of the guard but these days it's rarely used as an offensive position because it's very hard to control the distance from here.",

    "difficulty": 3,
    "videos": {},
    "images": []
  },
  {
    "category": "guards",
    "name": "Lockdown",

    "description": "This old school judo version of the half guard was further developed and popularized by Eddie Bravo who uses it to sweep and to attack the twister/ twister back take. Because of the painful leg configuration it offers a lot of control on the passer's legs. Very effective for slowing down the fight.",
    "difficulty": 4,
    "videos": {},
    "images": []
  },
  {
    "category": "guards",
    "name": "Knee shield",
    "description": "A more modern version on the classic halfguard with much better distance control. Most people use it defensively to counter the knee slide but it offers lots of sweeps and transitions into other guards such as the x-guard or the closed guard. Even a novice will be pretty hard to pass when he uses this position.",
    "difficulty": 4,
    "videos": {},
    "images": []
  },
  {
    "category": "guards",
    "name": "Quarter Guard",
    "description": "The 1/4 guard is basically another name for “knee slide bottom”. It's generally considered a weak position but players proficient in this guard will be able to surprise and be offensive against knee slide passers. Mostly used for transitioning into other guards and escaping but there are some sneaky sweeps too.",
    "difficulty": 4,
    "videos": {},
    "images": []
  },

  {
    "category": "guards",
    "name": "Deep half guard",

    "description": "One of the most commonly used half guard variations, extremely effective for sweeping and taking the back. The benefit of this guard is that you are right under the person, which allows you to freely manipulate their weight. A proficient deep half guard player is excellent at dealing with pressure and is able to sweep in literally any direction.",
    "difficulty": 4,
    "videos": {},
    "images": []
  },

  {
    "category": "guards",
    "name": "Octopus guard",
    "description": "The position normally begins in the closed guard. Begin by flaring his right elbow out with left hand, set up a basic wristlock, opponent defends the wristlock, use the momentum to duck right hand underneath opponents tricep. follow through by sitting up over his back. Eduardo Telles calls this position the “Octopus Guard.” It is an apt name: you are draping all four limbs over your opponent's back.",
    "difficulty": 4,
    "videos": {},
    "images": []
  },
  {
    "category": "guards",
    "name": "Tornado guard",

    "description": "Commonly entered from the knee shield half guard the tornado is a kind of inverted guard with one leg wedged in deeply between the top player's legs. It's quite rare to meet someone skilled in this position but the few who mastered it have incredibly unexpected and impressive sweeps, often right into dominant positons.",
    "difficulty": 4,
    "videos": {},
    "images": []
  },
  {
    "category": "guards",
    "name": "Sitting guard",

    "description": "When playing this guard you sit straight up against a standing opponent while hugging his leg. It's extremely aggressive allowing for sweeps, single legs and transitions in all directions. It's an awkward guard to try and pass because the posture is very unusual. Cobrinha is pretty much unstoppable from here.",
    "difficulty": 4,
    "videos": {},
    "images": []
  },
  {
    "category": "guards",
    "name": "Shin to Shin",

    "description": "In this variation of the sitting guard you hook the front of the top player his shin with your own shin, this allows you to lift and move the leg at will. Because it's so good at unbalancing it's often used to set up the closed guard and triangles/omoplatas.",
    "difficulty": 4,
    "videos": {},
    "images": []
  },
  {
    "category": "guards",
    "name": "Butterfly guard",

    "description": "One of the old school bread and butter guards used by legends such as Marcelo Garcia and Andre Galvao. It's so effective because it allows you to use both legs to lift and disturb your opponent's base. Incredibly efficient for sweeps, arm drags and a plethora of submissions.",
    "difficulty": 4,
    "videos": {},
    "images": []
  },
  {
    "category": "guards",
    "name": "Koala guard",

    "description": "The Koala guard, a signature guard of McKenzie Dern its a sit up guard and the set up is whereby you control the sleeve or belt of your opponent under their hip, with a foot on the knee and your knee of the hip/chest of your opponent. One thing to remeber is to never be flat on the back. McKenzie Dern has been very successful with this guard, being able to sweep or take the back of her opponets.",
    "difficulty": 4,
    "videos": {},
    "images": []
  },
  {
    "category": "guards",
    "name": "De La Riva",

    "description": "The de la Riva is one of the most common guards in modern jiu jitsu and with good reason. The hook allows you to stay close to the opponent while your other leg keeps him away and your grips break the posture. Mostly used as sweeping position (Berimbolo sweep) but also excellent at setting up submissions and back takes.",
    "difficulty": 4,
    "videos": {},
    "images": []
  },
  {
    "category": "guards",
    "name": "De La Riva X",

    "description": "The de la Riva x-guard control is one of the strongest ways to control both legs at the same time. It's extremely hard to pass as it's almost impossible to move your legs, which makes the sweeps close to unstoppable. Jt Torres is especially proficient at this position.",
    "difficulty": 4,
    "videos": {},
    "images": []
  },
  {
    "category": "guards",
    "name": "Reverse De La Riva",

    "description": "This is another essential modern guard, originally developed as a counter to the knee slide. The highest percentage technique from this position is the “kiss of the dragon” also known as spinning under. Apart from the kotd it's mostly a sweeping position with some sneaky omoplatas here and there.",
    "difficulty": 4,
    "videos": {},
    "images": []
  },
  {
    "category": "guards",
    "name": "Reverse De La Riva Spider",

    "description": "The Anaconda choke is similar to the D'arce choke, but you lock your arms the other way around. This submission is most commonly entered after a failed  arm in guillotine, from a front headlock position where both players lie on their back.",
    "difficulty": 4,
    "videos": {},
    "images": []
  },
  {
    "category": "guards",
    "name": "Mantis guard",

    "description": "One of the many weird guards invented/ named by Keenan Cornelius. Playing this kind of guard is basically like putting your opponent leg in a bucket of cement. It's not only hard to pass through; it's also really good for sweeping and especially for setting up the x-guard or the waiter sweep.",
    "difficulty": 4,
    "videos": {},
    "images": []
  },
  {
    "category": "guards",
    "name": "Spider Guard",

    "description": "The double biceps spider guards is one of the most ancient and secret open guards of bjj, lots of people make it work against standing opponents but it's truly lethal against an opponent on its knees. This guard offers everything, sweeps, submissions and smooth transitions. Definitely a guard worth spending time on.",
    "difficulty": 4,
    "videos": {},
    "images": []
  },
  {
    "category": "guards",
    "name": "Lasso Spider",

    "description": "The lasso spider guard is like the “harder to pass” cousin of the regular spider guard. By weaving one leg around the arm you create a strong pull that demolishes his posture. The lasso also directly sets up the omoplata, the triangle and lots of other sneaky attacks. Very effective guard in both attack and defense.",
    "difficulty": 4,
    "videos": {},
    "images": []
  },
  {
    "category": "guards",
    "name": "Inverted Guard",

    "description": "For most people ending up with your wrong side up is the worst case scenario but for a selected flexible few it's a position with great offensive potential. It's hard to force anything when you are upside down so it's mostly a guard where you lay traps and shoot triangles from weird angles.",
    "difficulty": 4,
    "videos": {},
    "images": []
  },
  {
    "category": "guards",
    "name": "Collar and Sleeve",

    "description": "The collar and sleeve guard is a weird position where you control one of his arms with just your foot which makes you feel like a cool Jedi master. It's an extremely aggressive guard that allows you to shoot submission after submission until one lands. Hard to learn but it can turn you into a sub only ninja.",
    "difficulty": 4,
    "videos": {},
    "images": []
  },
  {
    "category": "guards",
    "name": "Lo Guard",

    "description": "Lo guard is a spider guard variation where you hold one pants cuff, have one foot on the hip and have one spider guard hook. It's excellent for stopping toreando passes and it's primarily used to get under your opponent and sweep from there. Leandro Lo is the one who popularized it but now it's a very popular guard in competition.",
    "difficulty": 4,
    "videos": {},
    "images": []
  },
  {
    "category": "guards",
    "name": "Cross Grip Guard",

    "description": "In the cross grip guard you make it impossible for your opponent to put pressure on you by changing the angle of his body with the grip. It's a tricky sweep position with the constant threat of triangles and omoplatas. Most people didn't really know what it was until Ryan Hall made a DVD about it.",
    "difficulty": 4,
    "videos": {},
    "images": []
  },
  {
    "category": "guards",
    "name": "Worm guard",

    "description": "The Worm guard is another brain Child of Keenan Cornelius. Every passer gets a look of fear and doom in their eyes when confronted with this position because it's one of the very few guards that's both terrifyingly effective at stalling and at sweeping. Another one of its super powers is its ability to piss off higher belts.",
    "difficulty": 4,
    "videos": {},
    "images": []
  },
  {
    "category": "guards",
    "name": "Reverse De La Worm",

    "description": "The reverse de la worm guard is basically the same guard but you grip the lapel underneath your own leg on the outside of their leg instead of above. This provides support for your leg against being push downed and makes cool tornado type sweeps possible. Really fun guard to play.",
    "difficulty": 4,
    "videos": {},
    "images": []
  },
  {
    "category": "guards",
    "name": "Straight Leg Lapel Guard",

    "description": "A more basic version of the lapel guard that's not as commonly used but can still be quite lethal in the right hands. Hard to prepare for since there are so many different versions of the lapel guard. Can be used to set up all kinds of stuff but is most known for stalling.",
    "difficulty": 4,
    "videos": {},
    "images": []
  },
  {
    "category": "guards",
    "name": "50/50",

    "description": "This ridiculously controversial guard offers many offensive offers and it offers them to both players equally, making it a dangerous skill based position. It gets a lot of hate for supposedly being a stalling position but personally I believe it gets this reputation mostly from people who weren't properly prepared to fight it.",
    "difficulty": 4,
    "videos": {},
    "images": []
  },
  {
    "category": "guards",
    "name": "Single Leg X",

    "description": "A modern guard popularized by Marcelo Garcia, it's amazing for people with strong legs and it's very easy to transition into it. The crazy thing about this position is that you almost always sweep into a straight Footlock which makes it excellent for both sweeping and submitting. One very underestimated fact about this position that it effortlessly transitions in and out of the x-guard.",
    "difficulty": 4,
    "videos": {},
    "images": []
  },
  {
    "category": "guards",
    "name": "Bear Trap",

    "description": "The bear trap position was popularized by the 2009 ADCC final between Rafael Mendes and Cobrinha. The position itself is pretty much a calf slicer but, since most high level competitors don't like to tap, it has become mostly a sweeping/ back take guard. Mostly played in no gi but definitely a valid option in the gi as well.",
    "difficulty": 4,
    "videos": {},
    "images": []
  },
  {
    "category": "guards",
    "name": "Berimbolo",

    "description": "I'm kind of hesitant to call the Berimbolo position a guard but since it's been developed to such a high degree technically I feel like it has earned the name. This positon uses lots of complicated side rolls and leg positions and is mainly focused on taking the back but you could go directly for the mount, the leg drag or even the omoplata. The Mendes Bros and the Miyao Bros are the true pioneers of the Berimbolo.",
    "difficulty": 4,
    "videos": {},
    "images": []
  },
  {
    "category": "guards",
    "name": "X Guard",

    "description": "In my mind there is no better sweeping position period. It's been popularized by Marcelo Garcia who used it to slay giants and topple mountains. Great for the open weight categories, especially if you have strong legs. It's been around for a while now but it's still considered new school by most, completely essential for every competitor.",
    "difficulty": 4,
    "videos": {},
    "images": []
  },
  {
    "category": "guards",
    "name": "Curu Curu Guard",

    "description": "The curu curu guard is very similar to the X guard and was developed by Roberto Pagani. Instead of under hooking the leg of your opponent and crossing your legs like the x-guard, for the Curu Curu guard you need to overhook the leg and jam both of your feet under your opponent's crouch allowing to control the opponent's hip for a sweep.",
    "difficulty": 4,
    "videos": {},
    "images": []
  },
  {
    "category": "guards",
    "name": "Crab Ride",

    "description": "When your opponent is on his back and you are under his legs with your head in the same direction as his and are trying to control his legs with yours then you are in the crab ride position. It's very good for setting up berimbolos, twister hooks and leg drags, especially against people unfamiliar with the position (90% of jiujiteros).",
    "difficulty": 4,
    "videos": {},
    "images": []
  },
  {
    "category": "guards",
    "name": "Twister Hook Control",

    "description": "Often confused with the Berimbolo, the twister hook control is one of the strongest back attack positions. You can get it from everywhere: top side control, turtle, Berimbolo, half guard bottom etc. If you are fighting under adcc or mma rules you could go for the powerful back cranking twister submission as well.",
    "difficulty": 4,
    "videos": {},
    "images": []
  },
  {
    "category": "guards",
    "name": "Donkey guard",

    "description": "The donkey guard is a guard invented by Jeff Glover where you stand on your head and face your behind at an opponent in order to capitalize on his predictable attacks when he rushes in. It's only useful in bjj matches and it's probably the most “meta” guard to have ever been played at a high level.",
    "difficulty": 4,
    "videos": {},
    "images": []
  },
  {
    "category": "guards",
    "name": "Pancake guard",

    "description": "The pancake guard named by Keenan Cornelius is in fact a recovery guard crossing your feet to hook the leg, hip or inside of your opponent in order not to let your opponent pass your guard, and then flip the other leg like a pancake to recover to full guard. Important detail is the grip on the opposite sleep of the leg hooking the opponent in order not to allow the opponent to close his arms in seatbelt grip.",
    "difficulty": 4,
    "videos": {},
    "images": []
  }
]
