[
  {
    "category": "guards",
    "name": "Closed Guard",
    "description": "TThe closed guard or full guard is one of the absolutely most basic guards in Brazilian jiu-jitsu. It has been around for a long time and for good reason: it works. Over the years many sweeps, back takes and submissions have been developed from this position. It would be wise for beginners to focus on this guard.",
    "difficulty": 2,
    "videos": {},
    "images": []
  },
  {
    "category": "guards",
    "name": "Shawn Williams Guard",
    "description": "The Shawn Williams guard is a bit lesser known then the other variations but it is deadly effective. Its strength comes from its amazing ability to break the posture and to limit the opponent's options. It's very easy to anticipate and beat your opponent when you know everything the top player can do. Mostly submission oriented.",
    "difficulty": 4,
    "videos": {},
    "images": []
  },
  {
    "category": "guards",
    "name": "Rubber guard",
    "description": "The rubber guard is a guard popularized and named by Eddie Bravo, it has been very controversial so far but it has shown its effectiveness in mma at least. In this position you hold the shin instead of the knee which can put a lot of pressure on the knee, watch out inflexible people!",
    "difficulty": 3,
    "videos": {},
    "images": []
  },
  {
    "category": "guards",
    "name": "Rat Guard",

    "description": "The rat guard is an alternative to the rubber guard, for those who are not flexible. It comes from an old modified judo move. From closed guard, break the posture, and almost go for a guillotine, but instead of putting the forearm around the neck, place your hand under your hand under the leg while maintaining pressure on the neck. Remember to keep your opponents harm out of the way.",

    "difficulty": 4,
    "videos": {},
    "images": []
  },
  {
    "category": "guards",
    "name": "High Guard",
    "description": "The high guard is another variation of the closed guard where you lock your legs higher on the body; this allows you to isolate the shoulders. It's one of the positions with the best posture control and is deadly effective for setting ups submissions, primarily armbars and triangle chokes. Some would consider it the ancestor of the rubber guard.",

    "difficulty": 3,
    "videos": {},
    "images": []
  },
  {
    "category": "guards",
    "name": " J-guard",

    "description": "A variation on the closed guard where you make a 90° angle while holding one of his arms near your shoulder with your arm circled behind your neck. It's an uncommon position which means most people won't be prepared for it. Absolutely lethal because of the heavy posture control and superb angle.",

    "difficulty": 3,
    "videos": {},
    "images": []
  },
  {
    "category": "guards",
    "name": "Classic Halfguard",

    "description": "This is the original version of the halfguard where you figure four your legs around on of his and work the underhook with your outside arm. The development of this position was an absolute milestone in the evolution of the guard but these days it's rarely used as an offensive position because it's very hard to control the distance from here.",

    "difficulty": 3,
    "videos": {},
    "images": []
  },
  {
    "category": "guards",
    "name": "Lockdown",

    "description": "This old school judo version of the half guard was further developed and popularized by Eddie Bravo who uses it to sweep and to attack the twister/ twister back take. Because of the painful leg configuration it offers a lot of control on the passer's legs. Very effective for slowing down the fight.",
    "difficulty": 4,
    "videos": {},
    "images": []
  },
  {
    "category": "guards",
    "name": "Knee shield",
    "description": "A more modern version on the classic halfguard with much better distance control. Most people use it defensively to counter the knee slide but it offers lots of sweeps and transitions into other guards such as the x-guard or the closed guard. Even a novice will be pretty hard to pass when he uses this position.",
    "difficulty": 4,
    "videos": {},
    "images": []
  },
  {
    "category": "guards",
    "name": "Quarter Guard",
    "description": "The 1/4 guard is basically another name for “knee slide bottom”. It's generally considered a weak position but players proficient in this guard will be able to surprise and be offensive against knee slide passers. Mostly used for transitioning into other guards and escaping but there are some sneaky sweeps too.",
    "difficulty": 4,
    "videos": {},
    "images": []
  },

  {
    "category": "guards",
    "name": "Deep half guard",

    "description": "One of the most commonly used half guard variations, extremely effective for sweeping and taking the back. The benefit of this guard is that you are right under the person, which allows you to freely manipulate their weight. A proficient deep half guard player is excellent at dealing with pressure and is able to sweep in literally any direction.",
    "difficulty": 4,
    "videos": {},
    "images": []
  },

  {
    "category": "guards",
    "name": "Octopus guard",
    "description": "The position normally begins in the closed guard. Begin by flaring his right elbow out with left hand, set up a basic wristlock, opponent defends the wristlock, use the momentum to duck right hand underneath opponents tricep. follow through by sitting up over his back. Eduardo Telles calls this position the “Octopus Guard.” It is an apt name: you are draping all four limbs over your opponent's back.",
    "difficulty": 4,
    "videos": {},
    "images": []
  },
  {
    "category": "guards",
    "name": "Tornado guard",

    "description": "Commonly entered from the knee shield half guard the tornado is a kind of inverted guard with one leg wedged in deeply between the top player's legs. It's quite rare to meet someone skilled in this position but the few who mastered it have incredibly unexpected and impressive sweeps, often right into dominant positons.",
    "difficulty": 4,
    "videos": {},
    "images": []
  },
  {
    "category": "guards",
    "name": "Sitting guard",

    "description": "When playing this guard you sit straight up against a standing opponent while hugging his leg. It's extremely aggressive allowing for sweeps, single legs and transitions in all directions. It's an awkward guard to try and pass because the posture is very unusual. Cobrinha is pretty much unstoppable from here.",
    "difficulty": 4,
    "videos": {},
    "images": []
  },
  {
    "category": "guards",
    "name": "Shin to Shin",

    "description": "In this variation of the sitting guard you hook the front of the top player his shin with your own shin, this allows you to lift and move the leg at will. Because it's so good at unbalancing it's often used to set up the closed guard and triangles/omoplatas.",
    "difficulty": 4,
    "videos": {},
    "images": []
  },
  {
    "category": "guards",
    "name": "Butterfly guard",

    "description": "One of the old school bread and butter guards used by legends such as Marcelo Garcia and Andre Galvao. It's so effective because it allows you to use both legs to lift and disturb your opponent's base. Incredibly efficient for sweeps, arm drags and a plethora of submissions.",
    "difficulty": 4,
    "videos": {},
    "images": []
  },
  {
    "category": "guards",
    "name": "Koala guard",

    "description": "The Koala guard, a signature guard of McKenzie Dern its a sit up guard and the set up is whereby you control the sleeve or belt of your opponent under their hip, with a foot on the knee and your knee of the hip/chest of your opponent. One thing to remeber is to never be flat on the back. McKenzie Dern has been very successful with this guard, being able to sweep or take the back of her opponets.",
    "difficulty": 4,
    "videos": {},
    "images": []
  },
  {
    "category": "guards",
    "name": "De La Riva",

    "description": "The de la Riva is one of the most common guards in modern jiu jitsu and with good reason. The hook allows you to stay close to the opponent while your other leg keeps him away and your grips break the posture. Mostly used as sweeping position (Berimbolo sweep) but also excellent at setting up submissions and back takes.",
    "difficulty": 4,
    "videos": {},
    "images": []
  },
  {
    "category": "guards",
    "name": "De La Riva X",

    "description": "The de la Riva x-guard control is one of the strongest ways to control both legs at the same time. It's extremely hard to pass as it's almost impossible to move your legs, which makes the sweeps close to unstoppable. Jt Torres is especially proficient at this position.",
    "difficulty": 4,
    "videos": {},
    "images": []
  },
  {
    "category": "guards",
    "name": "Reverse De La Riva",

    "description": "This is another essential modern guard, originally developed as a counter to the knee slide. The highest percentage technique from this position is the “kiss of the dragon” also known as spinning under. Apart from the kotd it's mostly a sweeping position with some sneaky omoplatas here and there.",
    "difficulty": 4,
    "videos": {},
    "images": []
  },
  {
    "category": "guards",
    "name": "Reverse De La Riva Spider",

    "description": "The Anaconda choke is similar to the D'arce choke, but you lock your arms the other way around. This submission is most commonly entered after a failed  arm in guillotine, from a front headlock position where both players lie on their back.",
    "difficulty": 4,
    "videos": {},
    "images": []
  },
  {
    "category": "guards",
    "name": "Mantis guard",

    "description": "One of the many weird guards invented/ named by Keenan Cornelius. Playing this kind of guard is basically like putting your opponent leg in a bucket of cement. It's not only hard to pass through; it's also really good for sweeping and especially for setting up the x-guard or the waiter sweep.",
    "difficulty": 4,
    "videos": {},
    "images": []
  },
  {
    "category": "guards",
    "name": "Spider Guard",

    "description": "The double biceps spider guards is one of the most ancient and secret open guards of bjj, lots of people make it work against standing opponents but it's truly lethal against an opponent on its knees. This guard offers everything, sweeps, submissions and smooth transitions. Definitely a guard worth spending time on.",
    "difficulty": 4,
    "videos": {},
    "images": []
  },
  {
    "category": "guards",
    "name": "Lasso Spider",

    "description": "The lasso spider guard is like the “harder to pass” cousin of the regular spider guard. By weaving one leg around the arm you create a strong pull that demolishes his posture. The lasso also directly sets up the omoplata, the triangle and lots of other sneaky attacks. Very effective guard in both attack and defense.",
    "difficulty": 4,
    "videos": {},
    "images": []
  },
  {
    "category": "guards",
    "name": "Inverted Guard",

    "description": "For most people ending up with your wrong side up is the worst case scenario but for a selected flexible few it's a position with great offensive potential. It's hard to force anything when you are upside down so it's mostly a guard where you lay traps and shoot triangles from weird angles.",
    "difficulty": 4,
    "videos": {},
    "images": []
  },
  {
    "category": "guards",
    "name": "Collar and Sleeve",

    "description": "The collar and sleeve guard is a weird position where you control one of his arms with just your foot which makes you feel like a cool Jedi master. It's an extremely aggressive guard that allows you to shoot submission after submission until one lands. Hard to learn but it can turn you into a sub only ninja.",
    "difficulty": 4,
    "videos": {},
    "images": []
  },
  {
    "category": "guards",
    "name": "Lo Guard",

    "description": "Lo guard is a spider guard variation where you hold one pants cuff, have one foot on the hip and have one spider guard hook. It's excellent for stopping toreando passes and it's primarily used to get under your opponent and sweep from there. Leandro Lo is the one who popularized it but now it's a very popular guard in competition.",
    "difficulty": 4,
    "videos": {},
    "images": []
  },
  {
    "category": "guards",
    "name": "Cross Grip Guard",

    "description": "In the cross grip guard you make it impossible for your opponent to put pressure on you by changing the angle of his body with the grip. It's a tricky sweep position with the constant threat of triangles and omoplatas. Most people didn't really know what it was until Ryan Hall made a DVD about it.",
    "difficulty": 4,
    "videos": {},
    "images": []
  },
  {
    "category": "guards",
    "name": "Worm guard",

    "description": "The Worm guard is another brain Child of Keenan Cornelius. Every passer gets a look of fear and doom in their eyes when confronted with this position because it's one of the very few guards that's both terrifyingly effective at stalling and at sweeping. Another one of its super powers is its ability to piss off higher belts.",
    "difficulty": 4,
    "videos": {},
    "images": []
  },
  {
    "category": "guards",
    "name": "Reverse De La Worm",

    "description": "The reverse de la worm guard is basically the same guard but you grip the lapel underneath your own leg on the outside of their leg instead of above. This provides support for your leg against being push downed and makes cool tornado type sweeps possible. Really fun guard to play.",
    "difficulty": 4,
    "videos": {},
    "images": []
  },
  {
    "category": "guards",
    "name": "Straight Leg Lapel Guard",

    "description": "A more basic version of the lapel guard that's not as commonly used but can still be quite lethal in the right hands. Hard to prepare for since there are so many different versions of the lapel guard. Can be used to set up all kinds of stuff but is most known for stalling.",
    "difficulty": 4,
    "videos": {},
    "images": []
  },
  {
    "category": "guards",
    "name": "50/50",

    "description": "This ridiculously controversial guard offers many offensive offers and it offers them to both players equally, making it a dangerous skill based position. It gets a lot of hate for supposedly being a stalling position but personally I believe it gets this reputation mostly from people who weren't properly prepared to fight it.",
    "difficulty": 4,
    "videos": {},
    "images": []
  },
  {
    "category": "guards",
    "name": "Single Leg X",

    "description": "A modern guard popularized by Marcelo Garcia, it's amazing for people with strong legs and it's very easy to transition into it. The crazy thing about this position is that you almost always sweep into a straight Footlock which makes it excellent for both sweeping and submitting. One very underestimated fact about this position that it effortlessly transitions in and out of the x-guard.",
    "difficulty": 4,
    "videos": {},
    "images": []
  },
  {
    "category": "guards",
    "name": "Bear Trap",

    "description": "The bear trap position was popularized by the 2009 ADCC final between Rafael Mendes and Cobrinha. The position itself is pretty much a calf slicer but, since most high level competitors don't like to tap, it has become mostly a sweeping/ back take guard. Mostly played in no gi but definitely a valid option in the gi as well.",
    "difficulty": 4,
    "videos": {},
    "images": []
  },
  {
    "category": "guards",
    "name": "Berimbolo",

    "description": "I'm kind of hesitant to call the Berimbolo position a guard but since it's been developed to such a high degree technically I feel like it has earned the name. This positon uses lots of complicated side rolls and leg positions and is mainly focused on taking the back but you could go directly for the mount, the leg drag or even the omoplata. The Mendes Bros and the Miyao Bros are the true pioneers of the Berimbolo.",
    "difficulty": 4,
    "videos": {},
    "images": []
  },
  {
    "category": "guards",
    "name": "X Guard",

    "description": "In my mind there is no better sweeping position period. It's been popularized by Marcelo Garcia who used it to slay giants and topple mountains. Great for the open weight categories, especially if you have strong legs. It's been around for a while now but it's still considered new school by most, completely essential for every competitor.",
    "difficulty": 4,
    "videos": {},
    "images": []
  },
  {
    "category": "guards",
    "name": "Curu Curu Guard",

    "description": "The curu curu guard is very similar to the X guard and was developed by Roberto Pagani. Instead of under hooking the leg of your opponent and crossing your legs like the x-guard, for the Curu Curu guard you need to overhook the leg and jam both of your feet under your opponent's crouch allowing to control the opponent's hip for a sweep.",
    "difficulty": 4,
    "videos": {},
    "images": []
  },
  {
    "category": "guards",
    "name": "Crab Ride",

    "description": "When your opponent is on his back and you are under his legs with your head in the same direction as his and are trying to control his legs with yours then you are in the crab ride position. It's very good for setting up berimbolos, twister hooks and leg drags, especially against people unfamiliar with the position (90% of jiujiteros).",
    "difficulty": 4,
    "videos": {},
    "images": []
  },
  {
    "category": "guards",
    "name": "Twister Hook Control",

    "description": "Often confused with the Berimbolo, the twister hook control is one of the strongest back attack positions. You can get it from everywhere: top side control, turtle, Berimbolo, half guard bottom etc. If you are fighting under adcc or mma rules you could go for the powerful back cranking twister submission as well.",
    "difficulty": 4,
    "videos": {},
    "images": []
  },
  {
    "category": "guards",
    "name": "Donkey guard",

    "description": "The donkey guard is a guard invented by Jeff Glover where you stand on your head and face your behind at an opponent in order to capitalize on his predictable attacks when he rushes in. It's only useful in bjj matches and it's probably the most “meta” guard to have ever been played at a high level.",
    "difficulty": 4,
    "videos": {},
    "images": []
  },
  {
    "category": "guards",
    "name": "Pancake guard",

    "description": "The pancake guard named by Keenan Cornelius is in fact a recovery guard crossing your feet to hook the leg, hip or inside of your opponent in order not to let your opponent pass your guard, and then flip the other leg like a pancake to recover to full guard. Important detail is the grip on the opposite sleep of the leg hooking the opponent in order not to allow the opponent to close his arms in seatbelt grip.",
    "difficulty": 4,
    "videos": {},
    "images": []
  },
  {
    "category": "passing",
    "name": "Toreando",
    "description": "One of the most versatile and widely used guard passes is the Toreando or bull fighter pass. It's called the bull fighter pass because a common variation is that you push your opponent's legs towards him, and when he pushes back, you step to the side with perfect timing like a bull fighter against a bull. In reality there are many variations of the Toreando, which all suit slightly different situations, grips and postures of your opponent. But what all Toreandos have in common is that you hold your opponent's legs and pass around them.",
    "positions": ["Open Guard"],
    "difficulty": 2,
    "videos": {},
    "images": []
  },
  {
    "category": "passing",
    "name": "Knee Slide",
    "description": "The knee slide (also called the knee cut or knee through pass) is a guard pass that is often used at the highest levels of BJJ competition. It's usually initiated from a position in which one of the opponent's legs is trapped in between the passer's legs, such as reverse de la riva or half guard. Knee slides are very versatile, as they can be performed either with speed or with pressure, and with many different grips and weight distributions. They're also one of the most common guard pass techniques at the black belt level. This makes knee slides a must have tool for guard passers in BJJ.",
    "positions": ["De La Riva", "Reverse De La Riva", "Half Guard"],
    "difficulty": 4,
    "videos": {},
    "images": []
  },
  {
    "category": "passing",
    "name": "Near Side Knee Through",

    "description": "The near side knee through pass is similar to the knee slide, but the difference is that in the knee slide you pass to the opposite side of the leg you're using, and in the near side knee through you pass to the side of the leg you're pushing through the guard. An advantage of the near side knee through compared to the knee slide is that you don't necessarily need to step over one of your opponent's legs first.",
    "positions": ["Closed Guard", "Open Guard", "De La Riva"],
    "difficulty": 3,
    "videos": {},
    "images": []
  },
  {
    "category": "passing",
    "name": "Leg Drag",

    "description": "In the leg drag you drag one of your opponent's legs across your body to get passed it. It's an around-the-legs pass and is often combined with other around-the-legs passes such as the Toreando pass.",
    "positions": ["Open Guard", "De La Riva"],
    "difficulty": 4,
    "videos": {},
    "images": []
  },
  {
    "category": "passing",
    "name": "Smash Pass",

    "description": "The smash pass is a pressure pass in which you smash your opponent's legs together with your body weight. There's different variations, but usually you use your chest, belly or your hip to lay heavily on both of your opponent's legs. If you do the smash pass right, your opponent won't be able to move his legs at all, which will give you a free pathway to pass either to the mount or to his back.",
    "positions": ["Half Guard", "Open Guard"],
    "difficulty": 3,
    "videos": {},
    "images": []
  },
  {
    "category": "passing",
    "name": "Leg Weave",

    "description": "The leg weave pass is similar to the smash pass, but instead using your hips or belly to smash your opponent's legs to the floor, you use your shoulder. The advantage of this is that your legs are free to move around your opponent, and the drawback is that you naturally have less pressure.",
    "positions": ["Open Guard", "Half Guard"],
    "difficulty": 3,
    "videos": {},
    "images": []
  },
  {
    "category": "passing",
    "name": "Throw By",

    "description": "For the throw by grab one of your opponent's gi pants and throw that leg explosively past your body. The difference with the leg drag is that for the throw by you stand up straight and thus use all your dead lift muscles to get the leg passed you explosively. But, you can also use the throw by and then drop down again to stabilize in a leg drag position.",
    "positions": ["Spider Guard", "Spider Lasso Guard", "Open Guard"],
    "difficulty": 3,
    "videos": {},
    "images": []
  },
  {
    "category": "passing",
    "name": "Over Under Pass",

    "description": "The over under guard pass is so called because you have one arm under and one arm over your opponent's legs. The over under is a classic pressure pass and is usually initiated from some kind of half guard. Bernardo Faria is famous for using it a lot in competition.",
    "positions": ["Half Guard"],
    "difficulty": 4,
    "videos": {},
    "images": []
  },
  {
    "category": "passing",
    "name": "Double Under",

    "description": "For the double under pass you pass both your arms under your opponent's legs, and then you usually try to stack him. From the stacked position, you get a thumb-in cross collar grip and use that to push your opponent's legs out of the way. Alternatively, you can use the double under to set up the stack position and then pass in some other way, such as with a leg drag.",
    "positions": ["Half Guard", "Open Guard", "Closed Guard"],
    "difficulty": 4,
    "videos": {},
    "images": []
  },
  {
    "category": "passing",
    "name": "Long Step",

    "description": "The long step is an explosive guard pass. Because it's so explosive, it's also one of the harder passes to learn. To do the long step pass, you switch you hips to launch one of your legs far out of your opponent's guard, while landing with strong upper body pressure (for example with a good cross face). Although the long step is hard to learn, it's one of the passes you see the most at the black belt level. ",
    "positions": ["Single Leg X", "Reverse De La Riva"],
    "difficulty": 4,
    "videos": {},
    "images": []
  },

  {
    "category": "passing",
    "name": "Cross Grip",

    "description": "The cross grip pass is one of the strongest passes in Brazilian jiu jitsu according to Keenan Cornelius. What's great about it is that as soon as you get a cross grip on your opponent's gi pants, it becomes hard for your opponent to set up a good guard. The cross grip pass is also sometimes called the mad dog pass, because once you have the cross pants grip, you really also want the collar on the same side with your other hand, and if your opponents is denying this it can lead you to kind of keep running in circles trying to get that grip.",
    "positions": ["Open Guard"],
    "difficulty": 4,
    "videos": {},
    "images": []
  },

  {
    "category": "passing",
    "name": "X Pass",

    "description": "The X pass is a very useful guard pass. It can be done when you're standing with one leg in between your opponent's legs (what's often called the headquarters position). To do the X pass, you mule kick your trapped leg backwards, and before you put it back, you push your opponent's legs out of the way. This gets you passed the guard. I had a lot of success with this technique when I was a blue belt.",
    "positions": ["Open Guard"],
    "difficulty": 4,
    "videos": {},
    "images": []
  },
  {
    "category": "passing",
    "name": "Cartwheel Pass",

    "description": "The carthweel guard pass is effective from butterfly guard. You can also try to do it to pass open guard, which can be a good way to create movement and scrambles. But, you're unlikely to stick a guard pass from this, just because you leave so much space for your opponent to recover.",
    "positions": ["Butterfly Guard", "Open Guard"],
    "difficulty": 4,
    "videos": {},
    "images": []
  },
  {
    "category": "standing",
    "name": "Double Leg",
    "type": "Takedown",
    "description": "",
    "difficulty": 2,
    "videos": {},
    "images": []
  },
  {
    "category": "standing",
    "name": "Single Leg",
    "type": "Takedown",
    "description": "",
    "difficulty": 4,
    "videos": {},
    "images": []
  },
  {
    "category": "standing",
    "name": "Fireman's Carry",
    "type": "Takedown",
    "description": "",
    "difficulty": 3,
    "videos": {},
    "images": []
  },
  {
    "category": "standing",
    "name": "Ankle Pick",
    "type": "Takedown",
    "description": "",
    "difficulty": 4,
    "videos": {},
    "images": []
  },
  {
    "category": "standing",
    "name": "Low Single",
    "type": "Takedown",
    "description": "",
    "difficulty": 3,
    "videos": {},
    "images": []
  },
  {
    "category": "standing",
    "name": "Seoi Nage",
    "type": "Takedown",
    "description": "Shoulder Throw",
    "difficulty": 3,
    "videos": {},
    "images": []
  },
  {
    "category": "standing",
    "name": "Harai Goshi",
    "type": "Takedown",
    "description": "Hip Throw",
    "difficulty": 3,
    "videos": {},
    "images": []
  },
  {
    "category": "standing",
    "name": "Uchi Mata",
    "type": "Takedown",
    "description": "Inner Thigh Throw",
    "difficulty": 4,
    "videos": {},
    "images": []
  },
  {
    "category": "standing",
    "name": "O Goshi",
    "type": "Takedown",
    "description": "Major Hip Throw",
    "difficulty": 4,
    "videos": {},
    "images": []
  },
  {
    "category": "standing",
    "name": "Tai Otoshi",
    "type": "Takedown",
    "description": "Body Drop",
    "difficulty": 4,
    "videos": {},
    "images": []
  },

  {
    "category": "standing",
    "name": "Duck Under",
    "type": "Takedown",
    "description": "",
    "difficulty": 4,
    "videos": {},
    "images": []
  },

  {
    "category": "standing",
    "name": "O Soto Gari",
    "type": "Takedown",
    "description": "Major Outer Reaping",
    "difficulty": 4,
    "videos": {},
    "images": []
  },
  {
    "category": "standing",
    "name": "Ouchi Gari",
    "type": "Takedown",
    "description": "Major Inner Reaping",
    "difficulty": 4,
    "videos": {},
    "images": []
  },
  {
    "category": "standing",
    "name": "Kouchi Gari",
    "type": "Takedown",
    "description": "Minor Inner Reaping",
    "difficulty": 4,
    "videos": {},
    "images": []
  },
  {
    "category": "standing",
    "name": "Foot Sweep",
    "type": "Takedown",
    "description": "",
    "difficulty": 4,
    "videos": {},
    "images": []
  },
  {
    "category": "standing",
    "name": "Sumi Gaeshi",
    "type": "Takedown",
    "description": "Corner Reversal",
    "difficulty": 4,
    "videos": {},
    "images": []
  },
  {
    "category": "standing",
    "name": "Tomoe Nage",
    "type": "Takedown",
    "description": "Circle Throw",
    "difficulty": 4,
    "videos": {},
    "images": []
  },
  {
    "category": "standing",
    "name": "Collar Drag",
    "type": "Takedown",
    "description": "",
    "difficulty": 4,
    "videos": {},
    "images": []
  },
  {
    "category": "standing",
    "name": "Knee Tap",
    "type": "Takedown",
    "description": "Major Inner Reaping",
    "difficulty": 4,
    "videos": {},
    "images": []
  },
  {
    "category": "standing",
    "name": "Rear Body Lock",
    "type": "Takedown",
    "description": "Major Inner Reaping",
    "difficulty": 4,
    "videos": {},
    "images": []
  },
  {
    "category": "standing",
    "name": "Double Underhooks",
    "type": "Takedown",
    "description": "",
    "difficulty": 4,
    "videos": {},
    "images": []
  },
  {
    "category": "standing",
    "name": "Lateral Drop",
    "type": "Takedown",
    "description": "",
    "difficulty": 4,
    "videos": {},
    "images": []
  },
  {
    "category": "standing",
    "name": "Arm Drag",
    "type": "Takedown",
    "description": "",
    "difficulty": 4,
    "videos": {},
    "images": []
  },
  {
    "category": "standing",
    "name": "Guard Pull",
    "type": "Takedown",
    "description": "",
    "difficulty": 4,
    "videos": {},
    "images": []
  },
  {
    "category": "submission",
    "name": "Rear Naked Choke",
    "type": "Choke",
    "description": "The rear naked choke is one of BJJ's signature techniques. It requires little strength to apply, and is effective on opponents of all sizes, making it a great submission for smaller grapplers. As is the case with all effective submissions, the rear naked choke creates an anatomical mismatch. Specifically, it pits one person's arms against another person's neck. However, as opposed to other parts of the body, the neck is uniquely vulnerable to attack. An opponent can, for example, resist an armbar attempt by gripping his hands together and using strength to fight the attack. A rear naked choke, however, offers no such options. Once a rear naked choke is fully locked in, there is virtually no way to defend it. In addition to the rear naked choke's unique anatomical characteristics, its effectiveness stems from the position from which it is applied. Specifically, the rear naked choke is applied from the back Mount, which is widely considered the strongest position in BJJ due to the advantages it confers upon the person who attains it. The primary advantage of the back mount is that the person trapped in this position can't see his or her opponent. This allows the person who attains the position to launch attacks with little fear of retribution.",
    "positions": ["Back Control"],
    "difficulty": 2,
    "videos": {
      "Back Control": ["oYDe-hrazL8"]
    },
    "images": [
      "https://i1.wp.com/www.studentofbjj.com/wp-content/uploads/2017/02/rearnakedchoke.png?resize=648%2C458&ssl=1",
      "https://qph.cf2.quoracdn.net/main-qimg-c68ed3cfeec6317b99481791c1a7598c-lq",
      "https://www.bjjee.com/wp-content/uploads/2017/04/rnc.jpg"
    ]
  },
  {
    "category": "submission",
    "name": "Triangle",
    "type": "Choke",
    "description": "There are different types of triangle choke, but in every variation you're going to form a triangle around the neck of your opponent and one of his arms. Usually this triangle is formed with your legs by tucking one ankle behind the knee of your other leg before you squeeze to get the choke.  In some variations, however, you can use your arms to form the triangle shape as well. His arm being inside your legs is  important; it's a combination of your leg against one side of his neck and his own shoulder against the other side of his neck that makes this choke so effective! Here's a review of the five basic types of triangle choke. Note how every one of them includes his head and one arm trapped inside your triangled limbs...",
    "positions": ["Closed Guard", "Mount"],
    "difficulty": 4,
    "videos": {
      "Closed Guard": ["UGp6VzbkReA"],
      "Mount": ["Q0hYV74kWvU"],
      "Rear": ["96GTzr5AzKw"]
    },
    "images": [
      "https://media.tenor.com/EmV3_H1f0EkAAAAC/triangle-choke.gif",
      "https://www.bjjee.com/wp-content/uploads/2020/08/mounted-triangle-choke.jpg",
      "https://cdn.shopify.com/s/files/1/1800/2299/articles/Entries-Into-Rear-Triangle-Back-Position-by-John-Danaher_1024x1024.jpg?v=1559580395"
    ]
  },
  {
    "category": "submission",
    "name": "Arm Triangle",
    "type": "Choke",
    "description": "Arm triangle choke, side choke, or head and arm choke are generic terms describing blood chokeholds in which the opponent is strangled in between their own shoulder and the practitioner's arm. This is as opposed to the regular triangle choke, which denotes a chokehold using the legs, albeit with a similar mechanism of strangulation against the opponent's own shoulder. An arm triangle choke where the practitioner is on the side of the opponent and presses a forearm into the opposite side of the neck of the opponent is known as a side choke, such as from the kata-gatame hold. The time it takes for the opponent to be rendered unconscious does vary depending on the configuration of the grip and position, although the standard arm triangle is one of the fastest at 7.2 seconds.",
    "positions": ["Side Control", "Mount"],
    "difficulty": 3,
    "videos": {
      "Everywhere": ["zX4K7lFLhu8"],
      "Mount": ["FnV9CNgHsuc"]
    },
    "images": [
      "https://upload.wikimedia.org/wikipedia/commons/d/d5/Arm_triangle_choke.jpg",
      "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b5/Neil_Melanson_Training_Day-Arm_triangle_choke.jpg/800px-Neil_Melanson_Training_Day-Arm_triangle_choke.jpg?20121219162911"
    ]
  },
  {
    "category": "submission",
    "name": "Arm Bar",
    "type": "Limb Lock",
    "description": "The arm bar is a submission that overextends the elbow joint. It is one of the most commonly used submissions in Brazilian jiu jitsu. It's also used in other grappling arts, such as Judo, in which it's called ju ji gatame.",
    "positions": [
      "Side Control",
      "Mount",
      "Back Control",
      "Closed Guard",
      "Half Gaurd"
    ],
    "difficulty": 4,
    "videos": {
      "Everywhere": [""],
      "Mount": [""],
      "Closed Guard": [""],
      "Side Control": [""]
    },
    "images": []
  },
  {
    "category": "submission",
    "name": "Kimura",
    "type": "Limb Lock",
    "description": "The Kimura is a submission that internally rotates the shoulder too much. You can also use the kimura to sweep and control your opponent or to transition to other attacks.",
    "positions": ["Side Control", "Mount", "Back Control", "Closed Guard"],
    "difficulty": 3,
    "videos": {
      "Everywhere": [""],
      "Mount": [""],
      "Closed Guard": [""],
      "Side Control": [""]
    },
    "images": []
  },
  {
    "category": "submission",
    "name": "Americana",
    "type": "Limb Lock",
    "description": "The Americana is a submission that externally rotates the shoulder beyond its reach. It's a submission that is more commonly finished at the lower belt levels of Brazilian jiu jitsu.",
    "positions": [
      "Side Control",
      "Mount",
      "Back Control",
      "Closed Guard",
      "Kesa Gatame"
    ],
    "difficulty": 3,
    "videos": {
      "Everywhere": [""],
      "Mount": [""],
      "Closed Guard": [""],
      "Side Control": [""],
      "Kesa Gatame": [""]
    },
    "images": []
  },
  {
    "category": "submission",
    "name": "Arm Crush",
    "type": "Limb Lock",
    "description": "The arm crush hyperextends the elbow joint, just like the arm bar. However, the body configuration you use to apply this submission is completely different from the arm bar.",
    "positions": ["Half Gaurd", "Closed Guard"],
    "difficulty": 3,
    "videos": {
      "Everywhere": [""],
      "Mount": [""],
      "Closed Guard": [""],
      "Side Control": [""]
    },
    "images": []
  },
  {
    "category": "submission",
    "name": "Omoplata",
    "type": "Limb Lock",
    "description": "The Omoplata internally rotates the shoulder beyond its reach. It's similar to a Kimura, but you use your legs to apply the submission, rather than your arms.",
    "positions": ["Half Gaurd", "Closed Guard"],
    "difficulty": 4,
    "videos": {
      "Everywhere": [""],
      "Mount": [""],
      "Closed Guard": [""],
      "Side Control": [""]
    },
    "images": []
  },
  {
    "category": "submission",
    "name": "Huizinga Roll",
    "type": "Limb Lock",
    "description": "The Huizinga roll is like a reverse omoplata. It was popularized by the Dutch judoka Johan Huizinga, who used it effectively in competition. You can use the Huizinga roll to flip someone from turtle to his back, as well as to finish the submission.",
    "positions": ["Half Gaurd", "Closed Guard"],
    "difficulty": 4,
    "videos": {
      "Everywhere": [""],
      "Mount": [""],
      "Closed Guard": [""],
      "Side Control": [""]
    },
    "images": []
  },
  {
    "category": "submission",
    "name": "Monoplata",
    "type": "Limb Lock",
    "description": "The monoplata is similar to the arm bar in leg positioning, but instead of trying to hyperextend the elbow, you try to internally rotate the shoulder. This submission has been used to great effect by Marcelo Garcia.",
    "positions": ["Half Gaurd", "Closed Guard"],
    "difficulty": 4,
    "videos": {
      "Everywhere": [""],
      "Mount": [""],
      "Closed Guard": [""],
      "Side Control": [""]
    },
    "images": []
  },

  {
    "category": "submission",
    "name": "Baratoplata",
    "type": "Limb Lock",
    "description": "The Baratoplata submission was popularized by Rafael “Barata” Freitas. You can use the Baratoplata when you go for the Kimura, but your unable to separate your opponent's arm from his body.",
    "positions": ["Half Gaurd", "Closed Guard"],
    "difficulty": 4,
    "videos": {
      "Everywhere": [""],
      "Mount": [""],
      "Closed Guard": [""],
      "Side Control": [""]
    },
    "images": []
  },

  {
    "category": "submission",
    "name": "Tarikoplata",
    "type": "Limb Lock",
    "description": "The Tarikoplata is a submission that was invented by Tarik Hopstock. It's similar to the omoplata and Baratoplata, but the leg configuration is different. Tarik enters this submission from practically anywhere and uses it to sweep and submit his opponents.",
    "positions": ["Half Gaurd", "Closed Guard"],
    "difficulty": 4,
    "videos": {
      "Everywhere": [""],
      "Mount": [""],
      "Closed Guard": [""],
      "Side Control": [""]
    },
    "images": []
  },
  {
    "category": "submission",
    "name": "Mir Lock",
    "type": "Limb Lock",
    "description": "The Mir lock was made famous by Frank Mir who hit it in a UFC match. It's a devastating submission from closed guard that externally rotates the shoulder. This submission is almost never used, which suggests it might not be high percentage. But then again, Frank used it successfully in an MMA match, so make of that what you will.",
    "positions": ["Half Gaurd", "Closed Guard"],
    "difficulty": 4,
    "videos": {
      "Everywhere": [""],
      "Mount": [""],
      "Closed Guard": [""],
      "Side Control": [""]
    },
    "images": []
  },
  {
    "category": "submission",
    "name": "Standing Mir Lock",
    "type": "Limb Lock",
    "description": "Jon Jones hit what you might call a standing Mir lock against Glover Texeira in UFC 172. He didn't submit Glover with it, but he definitely hurt his shoulder (Glover had to get surgery to repair his labrum). I find it very interesting that these Americana style submissions are used in an explosive way in MMA, more so than in Brazilian jiu jitsu.",
    "positions": ["Half Gaurd", "Closed Guard"],
    "difficulty": 4,
    "videos": {
      "Everywhere": [""],
      "Mount": [""],
      "Closed Guard": [""],
      "Side Control": [""]
    },
    "images": []
  },
  {
    "category": "submission",
    "name": "Monocana",
    "type": "Limb Lock",
    "description": "From the Monoplata position you can also hit an Americana style submission, if your opponent rotates his shoulder externally to defend the monoplata. I haven't seen this submission very often, but I've seen Marcelo Garcia hit it in training. (I wonder if the opponent could easily try a hitch hiker escape.)",
    "positions": ["Half Gaurd", "Closed Guard"],
    "difficulty": 4,
    "videos": {
      "Everywhere": [""],
      "Mount": [""],
      "Closed Guard": [""],
      "Side Control": [""]
    },
    "images": []
  },
  {
    "category": "submission",
    "name": "Standing Arm Lock",
    "type": "Limb Lock",
    "description": "Brazilian jiu jitsu doesn't use a lot of standing submissions, and they're largely thought to be low percentage. But tell that to Shinya Aoki! He used an Aikido style arm lock to break someone's arm from the standing position during an MMA match. (Again, I wonder how many low percentage submissions would work better if you apply them explosively.)",
    "positions": ["Half Gaurd", "Closed Guard"],
    "difficulty": 4,
    "videos": {
      "Everywhere": [""],
      "Mount": [""],
      "Closed Guard": [""],
      "Side Control": [""]
    },
    "images": []
  },
  {
    "category": "submission",
    "name": "Bulldog Choke",
    "type": "Limb Lock",
    "description": "The bulldog choke is not very common because your opponent needs to mess up quite a bit to end up there. But, Ben Askren used it to claim a comeback victory against Robbie Lawler in the UFC, and it also occurs sometimes in street fights.",
    "positions": ["Half Gaurd", "Closed Guard"],
    "difficulty": 4,
    "videos": {
      "Everywhere": [""],
      "Mount": [""],
      "Closed Guard": [""],
      "Side Control": [""]
    },
    "images": []
  },
  {
    "category": "submission",
    "name": "Kangaroo Choke",
    "type": "Limb Lock",
    "description": "I saw a kangaroo use this choke and I started using it myself as well. Kangaroos have the perfect bodies for this choke, with their short and strong arms and long fingers. It's harder for me to do because I'm a human, but I can get this from belly down back mount when I completely flatten out my opponent. I grab an S-grip around my opponent's chin and squeeze my hands to my chest, just like the kangaroo in this video.",
    "positions": ["Half Gaurd", "Closed Guard"],
    "difficulty": 4,
    "videos": {
      "Everywhere": [""],
      "Mount": [""],
      "Closed Guard": [""],
      "Side Control": [""]
    },
    "images": []
  },
  {
    "category": "submission",
    "name": "Guillotine",
    "type": "Limb Lock",
    "description": "The guillotine is one of the most frequently used and highest percentage submissions in Brazilian jiu jitsu. It can be done with a variety of grips. A major distinction is between arm in guillotines and arm out guillotines, which function quite differently from each other.",
    "positions": ["Half Gaurd", "Closed Guard"],
    "difficulty": 4,
    "videos": {
      "Everywhere": [""],
      "Mount": [""],
      "Closed Guard": [""],
      "Side Control": [""]
    },
    "images": []
  },
  {
    "category": "submission",
    "name": "D'arce Choke",
    "type": "Limb Lock",
    "description": "The D'arce choke or Brabo choke is a head and arm choke. It's often paired with guillotines and Anaconda chokes. It's often also a neck crank, and it's one of the hardest chokes in jiu jitsu to apply cleanly.",
    "positions": ["Half Gaurd", "Closed Guard"],
    "difficulty": 4,
    "videos": {
      "Everywhere": [""],
      "Mount": [""],
      "Closed Guard": [""],
      "Side Control": [""]
    },
    "images": []
  },
  {
    "category": "submission",
    "name": "Anaconda Choke",
    "type": "Limb Lock",
    "description": "The Anaconda choke is similar to the D'arce choke, but you lock your arms the other way around. This submission is most commonly entered after a failed  arm in guillotine, from a front headlock position where both players lie on their back.",
    "positions": ["Half Gaurd", "Closed Guard"],
    "difficulty": 4,
    "videos": {
      "Everywhere": [""],
      "Mount": [""],
      "Closed Guard": [""],
      "Side Control": [""]
    },
    "images": []
  },
  {
    "category": "submission",
    "name": "Japanese Neck Tie",
    "type": "Limb Lock",
    "description": "The Japanese neck tie lies somewhere in between the arm in guillotine and the Anaconda choke. Your hands are configured as in a guillotine, but you put your belly behind the back of your opponent's head and catch his leg with your legs, so that you can compress his head towards his chest.",
    "positions": ["Half Gaurd", "Closed Guard"],
    "difficulty": 4,
    "videos": {
      "Everywhere": [""],
      "Mount": [""],
      "Closed Guard": [""],
      "Side Control": [""]
    },
    "images": []
  },
  {
    "category": "submission",
    "name": "Peruvian Neck Tie",
    "type": "Limb Lock",
    "description": "The Peruvian lies in between the arm in guillotine and the D'Arce choke. It's also similar to the Japanese neck tie in that you keep the arm in guillotine grips, but you try to use your body to compress the head towards the chest. But with this submission you compress the head be stepping your leg over the head and sitting down, and you prevent the rolling escape by throwing your other leg over the back.",
    "positions": ["Half Gaurd", "Closed Guard"],
    "difficulty": 4,
    "videos": {
      "Everywhere": [""],
      "Mount": [""],
      "Closed Guard": [""],
      "Side Control": [""]
    },
    "images": []
  },
  {
    "category": "submission",
    "name": "North South Choke",
    "type": "Limb Lock",
    "description": "The north south choke is typically applied from north south, with your arm around the neck and nothing on the other side of the neck. Your arm needs to be extremely tight and your shoulder needs to dip very low, in order to apply the choke on both sides of the neck using just one arm. The north south is very hard to get good at, but is used at the highest levels of jiu jitsu, for example by Marcelo Garcia.",
    "positions": ["Half Gaurd", "Closed Guard"],
    "difficulty": 4,
    "videos": {
      "Everywhere": [""],
      "Mount": [""],
      "Closed Guard": [""],
      "Side Control": [""]
    },
    "images": []
  },
  {
    "category": "submission",
    "name": "Buggy Choke",
    "type": "Limb Lock",
    "description": "The Buggy choke is an uncommon head and arm choke from bottom side control. You grab your leg behind the back of your opponent's neck and pressure into his neck with your lat and onto his arm with your thigh. Most notably, Kade Rotulo hit this in competition in 2020.",
    "positions": ["Half Gaurd", "Closed Guard"],
    "difficulty": 4,
    "videos": {
      "Everywhere": [""],
      "Mount": [""],
      "Closed Guard": [""],
      "Side Control": [""]
    },
    "images": []
  },
  {
    "category": "submission",
    "name": "Inverted Triangle",
    "type": "Limb Lock",
    "description": "The inverted triangle is a tricky submission, that's typically hit from bottom side control while the opponent is not paying attention. Compared to the normal triangle, your head faces the other way (towards your opponent's legs). It can be hard to finish this submission.",
    "positions": ["Half Gaurd", "Closed Guard"],
    "difficulty": 4,
    "videos": {
      "Everywhere": [""],
      "Mount": [""],
      "Closed Guard": [""],
      "Side Control": [""]
    },
    "images": []
  },
  {
    "category": "submission",
    "name": "Back Triangle",
    "type": "Limb Lock",
    "description": "The back triangle is often entered from the back position. It's quite hard to finish the choke with the back triangle, but it can be done. More commonly, the back triangle position is used to attack arm locks.",
    "positions": ["Half Gaurd", "Closed Guard"],
    "difficulty": 4,
    "videos": {
      "Everywhere": [""],
      "Mount": [""],
      "Closed Guard": [""],
      "Side Control": [""]
    },
    "images": []
  },
  {
    "category": "submission",
    "name": "Inverted Back Triangle",
    "type": "Limb Lock",
    "description": "In the inverted back triangle, you're on your opponent's back and you face his legs. This submission is rarely used in Brazilian jiu jitsu, but it's a staple in Judo because it's a quick attack you can do from turtle. ",
    "positions": ["Half Gaurd", "Closed Guard"],
    "difficulty": 4,
    "videos": {
      "Everywhere": [""],
      "Mount": [""],
      "Closed Guard": [""],
      "Side Control": [""]
    },
    "images": []
  },
  {
    "category": "submission",
    "name": "Loop Choke",
    "type": "Limb Lock",
    "description": "The loop choke is a gi choke that's a bit similar to a guillotine. You grab a cross collar grip and loop your arm around the back of your opponent's head, and then use something to pressure his head down (usually your free arm).",
    "positions": ["Half Gaurd", "Closed Guard"],
    "difficulty": 4,
    "videos": {
      "Everywhere": [""],
      "Mount": [""],
      "Closed Guard": [""],
      "Side Control": [""]
    },
    "images": []
  },
  {
    "category": "submission",
    "name": "Clock Choke",
    "type": "Limb Lock",
    "description": "The clock choke is a gi choke from top side turtle. You grab the same side collar (so right collar with your right arm), make sure it's under the neck and walk over to the other side of the turtle while keeping your opponent in place. This submission is reasonably rare.",
    "positions": ["Half Gaurd", "Closed Guard"],
    "difficulty": 4,
    "videos": {
      "Everywhere": [""],
      "Mount": [""],
      "Closed Guard": [""],
      "Side Control": [""]
    },
    "images": []
  },
  {
    "category": "submission",
    "name": "Ezekiel Choke",
    "type": "Limb Lock",
    "description": "The Ezekiel choke is primarily a gi choke, although a no gi version exists (but it's much less common). Typically you grab a deep cross face, and with your cross face arm you grab the sleeve of your free hand, and then you pass your free hand over the throat of your opponent. This closed a loop around the neck and causes a tight strangle.",
    "positions": ["Half Gaurd", "Closed Guard"],
    "difficulty": 4,
    "videos": {
      "Everywhere": [""],
      "Mount": [""],
      "Closed Guard": [""],
      "Side Control": [""]
    },
    "images": []
  },
  {
    "category": "submission",
    "name": "Ezekiel From The Back",
    "type": "Limb Lock",
    "description": "The Ezekiel can also be applied from the back, in which case the arm of your opponent is almost always also trapped, which is a major difference to the front Ezekiel. The Ezekiel from the back was one of the most commonly hit submissions in the IBJJF Worlds of 2019.",
    "positions": ["Half Gaurd", "Closed Guard"],
    "difficulty": 4,
    "videos": {
      "Everywhere": [""],
      "Mount": [""],
      "Closed Guard": [""],
      "Side Control": [""]
    },
    "images": []
  },
  {
    "category": "submission",
    "name": "Lapel Choke From The Back",
    "type": "Limb Lock",
    "description": "The lapel choke is the simplest gi choke from the back. It's less strong than the bow and arrow choke, but you give up hardly any control while trying it, so you can basically try it for free.",
    "positions": ["Half Gaurd", "Closed Guard"],
    "difficulty": 4,
    "videos": {
      "Everywhere": [""],
      "Mount": [""],
      "Closed Guard": [""],
      "Side Control": [""]
    },
    "images": []
  },
  {
    "category": "submission",
    "name": "Bow And Arrow Choke",
    "type": "Limb Lock",
    "description": "The bow and arrow is perhaps the single most effective submission in gi jiu jitsu. You are basically applying a gi choke with the strength of your deadlift. (I also have a theory that in the bow and arrow, your opponent's neck functions as a pulley, which even doubles the force you put into the choke. But I'm not a physicist.)",
    "positions": ["Half Gaurd", "Closed Guard"],
    "difficulty": 4,
    "videos": {
      "Everywhere": [""],
      "Mount": [""],
      "Closed Guard": [""],
      "Side Control": [""]
    },
    "images": []
  },
  {
    "category": "submission",
    "name": "Cross Collar Choke",
    "type": "Limb Lock",
    "description": "The cross collar choke is often said to be the first choke you learn and the last choke you master. It's basic, but hard to do against knowledgeable opponents. Roger Gracie is famous for mastering this submission.",
    "positions": ["Half Gaurd", "Closed Guard"],
    "difficulty": 4,
    "videos": {
      "Everywhere": [""],
      "Mount": [""],
      "Closed Guard": [""],
      "Side Control": [""]
    },
    "images": []
  },
  {
    "category": "submission",
    "name": "Baseball Bat Choke",
    "type": "Limb Lock",
    "description": "The baseball bat choke is famous for choking out more people than any other choke. This happens especially often with the baseball choke from bottom side control, because nobody likes to tap after just having established a 'dominant' position.",
    "positions": ["Half Gaurd", "Closed Guard"],
    "difficulty": 4,
    "videos": {
      "Everywhere": [""],
      "Mount": [""],
      "Closed Guard": [""],
      "Side Control": [""]
    },
    "images": []
  },
  {
    "category": "submission",
    "name": "Pena Choke",
    "type": "Limb Lock",
    "description": "The Pena choke is named after Felipe Pena. It's similar to a bow and arrow choke, but instead of grabbing your opponent's collar, you grab your own lapel and feed it around your opponent's neck. You then throw your top leg over your opponent's head so that you can pressure him into the choke.",
    "positions": ["Half Gaurd", "Closed Guard"],
    "difficulty": 4,
    "videos": {
      "Everywhere": [""],
      "Mount": [""],
      "Closed Guard": [""],
      "Side Control": [""]
    },
    "images": []
  },
  {
    "category": "submission",
    "name": "Papercutter Choke",
    "type": "Limb Lock",
    "description": "The papercutter choke is a choke from north south. You simply grab the collar and push your forearm into the neck, and make sure the opponent can't turn towards you to relieve the pressure (usually by lifting his near shoulder with your free arm).",
    "positions": ["Half Gaurd", "Closed Guard"],
    "difficulty": 4,
    "videos": {
      "Everywhere": [""],
      "Mount": [""],
      "Closed Guard": [""],
      "Side Control": [""]
    },
    "images": []
  },
  {
    "category": "submission",
    "name": "Lapel Choke From Side Control",
    "type": "Limb Lock",
    "description": "There's a lapel choke from top side control where you feed your own lapel around your opponent's neck and then walk around to north south to cause the choke. It's sometimes called the Ninja choke because you can pass the lapel around the neck quite sneakily.",
    "positions": ["Half Gaurd", "Closed Guard"],
    "difficulty": 4,
    "videos": {
      "Everywhere": [""],
      "Mount": [""],
      "Closed Guard": [""],
      "Side Control": [""]
    },
    "images": []
  },
  {
    "category": "submission",
    "name": "Diesel Squeezel",
    "type": "Limb Lock",
    "description": "There's a guillotine style choke where you jam the fist of your free arm in the neck. Keenan Cornelius calls this the Diesel Squeezel, Karel Silver Fox calls it the iron fist, and Neil Melanson also uses it. Keenan says that it's the only thing that he always taps Craig Jones with. For me it's actually my favorite submission, and I typically hit it from bottom half guard or side control.",
    "positions": ["Half Gaurd", "Closed Guard"],
    "difficulty": 4,
    "videos": {
      "Everywhere": [""],
      "Mount": [""],
      "Closed Guard": [""],
      "Side Control": [""]
    },
    "images": []
  },
  {
    "category": "submission",
    "name": "Front Naked Choke",
    "type": "Limb Lock",
    "description": "The front naked choke uses the rear naked choke grip, but is applied when you're in front of your opponent. It's quite an uncommon submission.",
    "positions": ["Half Gaurd", "Closed Guard"],
    "difficulty": 4,
    "videos": {
      "Everywhere": [""],
      "Mount": [""],
      "Closed Guard": [""],
      "Side Control": [""]
    },
    "images": []
  },
  {
    "category": "sweeps",
    "name": "Hip Bump Sweep",
    "description": "",
    "positions": ["Closed Guard"],
    "difficulty": 2,
    "videos": {},
    "images": []
  },
  {
    "category": "sweeps",
    "name": "Scissor Sweep",
    "description": "",
    "positions": ["Closed Guard", "Half Guard"],
    "difficulty": 4,
    "videos": {},
    "images": []
  },
  {
    "category": "sweeps",
    "name": "Lumberjack Sweep",
    "description": "",
    "positions": ["Closed Guard", "Open Guard"],
    "difficulty": 3,
    "videos": {},
    "images": []
  },
  {
    "category": "sweeps",
    "name": "Waiter Sweep",
    "description": "",
    "positions": ["Closed Guard", "Deep Half Guard"],
    "difficulty": 4,
    "videos": {},
    "images": []
  },
  {
    "category": "sweeps",
    "name": "Balloon Sweep",
    "description": "",
    "positions": ["Closed Guard", "Open Guard"],
    "difficulty": 3,
    "videos": {},
    "images": []
  },
  {
    "category": "sweeps",
    "name": "100% Sweep",
    "description": "",
    "positions": ["Closed Guard"],
    "difficulty": 3,
    "videos": {},
    "images": []
  },
  {
    "category": "sweeps",
    "name": "Omoplata Sweep",
    "description": "",
    "positions": ["Closed Guard"],
    "difficulty": 3,
    "videos": {},
    "images": []
  },
  {
    "category": "sweeps",
    "name": "Old School Sweep",
    "description": "",
    "positions": ["Half Gaurd"],
    "difficulty": 4,
    "videos": {},
    "images": []
  },
  {
    "category": "sweeps",
    "name": "John Wayne Sweep",
    "description": "",
    "positions": ["Half Gaurd"],
    "difficulty": 4,
    "videos": {},
    "images": []
  },
  {
    "category": "sweeps",
    "name": "Pendulum Sweep",
    "description": "",
    "positions": ["Half Gaurd"],
    "difficulty": 4,
    "videos": {},
    "images": []
  },

  {
    "category": "sweeps",
    "name": "Foot Grab Sweep",
    "description": "",
    "positions": ["Half Gaurd"],
    "difficulty": 4,
    "videos": {},
    "images": []
  },

  {
    "category": "sweeps",
    "name": "Butterfly Sweep",
    "description": "",
    "positions": ["Half Gaurd", "Open Guard"],
    "difficulty": 4,
    "videos": {},
    "images": []
  },
  {
    "category": "sweeps",
    "name": "De La Riva Sweep",
    "description": "",
    "positions": ["De La Riva"],
    "difficulty": 4,
    "videos": {},
    "images": []
  },
  {
    "category": "sweeps",
    "name": "Heel Grab Sweep",
    "description": "",
    "positions": ["Open Guard", "Closed Guard"],
    "difficulty": 4,
    "videos": {},
    "images": []
  },
  {
    "category": "sweeps",
    "name": "Tripod Sweep",
    "description": "",
    "positions": ["Open Guard", "De La Riva", "Single Leg X"],
    "difficulty": 4,
    "videos": {
      "Everywhere": [""],
      "Mount": [""],
      "Closed Guard": [""],
      "Side Control": [""]
    },
    "images": []
  },
  {
    "category": "sweeps",
    "name": "Tomahawk Sweep",
    "description": "",
    "positions": ["Open Guard"],
    "difficulty": 4,
    "videos": {},
    "images": []
  }
]
